app/controllers/comments_controller.rb

  def create
  	@post = Post.find(params[:post_id])
	# raise params[:comment][:text].inspect
  	@comment = @post.comments.build(params[:comment])
  	# raise params[:comment][:text].inspect

  	@comment.save
---
SELECT `posts`.* FROM `posts` WHERE `posts`.`id` = 1 LIMIT 1
INSERT INTO `comments` (`comment`, `created_at`, `post_id`, `updated_at`) VALUES (NULL, '2013-03-15 19:18:37', 2, '2013-03-15 19:18:37')

  def destroy
  	@post = Post.find(params[:post_id])
    @comment = @post.comments.find(params[:id])
    @comment.destroy
---
SELECT `posts`.* FROM `posts` WHERE `posts`.`id` = 3 LIMIT 1
SELECT `comments`.* FROM `comments` WHERE `comments`.`post_id` = 3 AND `comments`.`id` = 15 LIMIT 1
DELETE FROM `comments` WHERE `comments`.`id` = 11